{"id": "4ef838f5b24d4a8296350be39d55cc02", "title": "Incident Report TIC-IPS20240920-001982 - Unable to upload mandatory documents v1.0", "body": "INCIDENT REPORT TIC-IPS20240920-001982\nDocument Control\t\nVersion Date Author Comment 0.1 21 Sept 2024 Joe Chen Base Version 1.0 22 Sept 2024 Arianty Oey Reviewed\nMHA00004000007520 – CONFIDENTIAL / SENSITIVE HIGH Page 2 of 5\nSection 1 - Incident Summary Incident Ticket No.: TIC-IPS20240920-001982 Severity: Sev-1 Reported By: Name / Contact ICA CS3 Reported Date: 20 Sept 2024 Report Prepared by: Name / Contact Joe Chen Report Prepared Date: 21 Sept 2024 Report Reviewed by:\nName / Contact Arianty Oey Review Date: 22 Sept 2024 Application System / Module / Function: IPSES / Application Submission (Upload Document) Incident Summary: MOP reported that there is no document uploading box for educational qualification documents for himself, though it was present for his wife/spouse.\nSection 2 – Incident Analysis (briefly explain the cause and impact of incident) Background of Incident: MOP wrote in through ICA CS3 that there is no functionality available for him to upload the mandatory documents. Root Cause Analysis: There was misalignment logic at the persona level for specifically PR holders applying for SC causing the document reconciliation logic not to be triggered properly. Resolution Details: IPSES FE will correct the persona categorization logic to ensure that all the necessary mandatory documents are included in the upload requirements for PR pass holders applying for Singapore Citizenship Preventive Measure: More thorough regression testing to be done to detect similar scenarios i.e. upload box present in some scenarios but not available in some scenarios Mitigation Plan (as of 25th Sept): Impacted Cases - IPSES: As of today, there are total of 188 draft impacted by this scenarios. Out of which: 125 draft is currently in Fill in particulars. Once fix is deployed, those in Fill in Particular stage will be required to submit the necessary documents. 45 is in Upload Document stage. We are planning to deploy a banner on Monday to request MoP to go back and re-upload the mandatory documents. 18 is in Review and Declare stage. Those in Review and Declare stage and proceed to submit will flow to IPS without the mandatory document. Impacted Cases - IPS: As of 25th Sept, there are total 240 applications impacted with mandatory documents not submitted. These applications are currently stuck and have not flow to Verification Worklist yet. We will need to patch the status of the cases to flow to Verification. We will be working on the list of documents that officers need to collect from MoP. Once the case flow to Verification tasklist, we will need officer to raise clarification to MoP to submit the document.\nSection 3 - Incident Report Approval (to be filled in by HTX and PDD) Reviewer Name / Contact Review Date: Approver Name / Contact Approve Date:\n~ End of Document ~\nMHA00004000007520 – CONFIDENTIAL / SENSITIVE HIGH Page 2 of 5", "source": "/Users/kundan.jha/KnowledgeAI/raw/Incident Report TIC-IPS20240920-001982 - Unable to upload mandatory documents v1.0.docx"}